posts/2015-01-13-good-friday.org
#+date: <2015-01-13>
#+filetags: prayer
#+title: Good Friday

Even though I fear the answer,\\
I must still ask the question\\
that was posed\\
by the one who betrayed the Lord.\\
\\
"Am I the one?"\\
\\
Am I the one who\\
sat in the comfort\\
of the palace of the High Priest\\
to plot your death\\
because you were a threat\\
to my religious authority?\\
\\
Am I the one who\\
from the confines of another palace\\
washed my hands of you,\\
preferring instead the\\
power and prestige\\
of my position?\\
\\
Or am I the one\\
who denied any\\
knowledge of you,\\
fearing what might happen\\
if I should follow you to the cross?\\
\\
Might I be the one\\
full of sorrow,\\
but devoid of hope,\\
who wept in your presence,\\
and watched you die?\\
\\
On this day,\\
Lord Jesus,\\
We are all of these.\\
\\
Put in our hands a crown of thorns,\\
and show us again what Love can make\\
with two pieces of wood and a few nails.\\
\\
Christ have mercy on us,\\
\\

/Amen/
