docs/posts/2015-01-13-good-friday.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- Apr 08, 2025 19:52 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Good Friday</title>
<meta name="author" content="Randy Ridenour" />
<meta name="generator" content="Org Mode" />
<link rel='icon' type='image/x-icon' href='/images/favicon.ico'/>
<meta name='viewport' content='width=device-width, initial-scale=1'>
<link rel='stylesheet' href='/css/normalize.css' type='text/css'/>
<link rel='stylesheet' href='/css/main.css' type='text/css'/>
</head>
<body>
<header id="top" class="status">
<div class="banner">
  <h2><a href="/">Randy Ridenour</a></h2>
  <nav class="navbar">
    <ul>
      <li><a href="/">Home</a></li>
      <li><a href="/posts/">Blog</a></li>
      <li><a href="/about.html">About</a></li>
      <li><a href="/tags/">Tags</a></li>
      <li><a href="/atom.xml">Feed</a></li>
    </ul>
  </nav>
</div>
</header>
<main id="content" class="content">
<header>
<h1 class="title">Good Friday</h1>
<p class="subtitle" role="doc-subtitle">Jan 13, 2015 00:00</p>
</header><p>
Even though I fear the answer,<br>
I must still ask the question<br>
that was posed<br>
by the one who betrayed the Lord.<br>
<br>
&ldquo;Am I the one?&rdquo;<br>
<br>
Am I the one who<br>
sat in the comfort<br>
of the palace of the High Priest<br>
to plot your death<br>
because you were a threat<br>
to my religious authority?<br>
<br>
Am I the one who<br>
from the confines of another palace<br>
washed my hands of you,<br>
preferring instead the<br>
power and prestige<br>
of my position?<br>
<br>
Or am I the one<br>
who denied any<br>
knowledge of you,<br>
fearing what might happen<br>
if I should follow you to the cross?<br>
<br>
Might I be the one<br>
full of sorrow,<br>
but devoid of hope,<br>
who wept in your presence,<br>
and watched you die?<br>
<br>
On this day,<br>
Lord Jesus,<br>
We are all of these.<br>
<br>
Put in our hands a crown of thorns,<br>
and show us again what Love can make<br>
with two pieces of wood and a few nails.<br>
<br>
Christ have mercy on us,<br>
<br>
</p>

<p>
<i>Amen</i>
</p>


<div class="tagline" id="org5be8289">
<p>
Tagged: <a href="../tags/prayer.html">Prayer</a>
</p>

</div>
</main>
<footer id="postamble" class="status">
<div class='footer'>
  Copyright © 2024 <a href='mailto:rlridenour@fastmail.com'>Randy Ridenour.</a><br>
  Last updated on Apr 08, 2025 19:52.<br>
  Generated using <a href="https://www.gnu.org/software/emacs/">Emacs</a> 30.1 (<a href="https://orgmode.org">Org</a> mode 9.8-pre).
</div>
</footer>
</body>
</html>
